# 2. Очень лёгкая задача (два ксерокса)
# Условие достаточности времени - проверяется по количеству копий, которые оба ксерокса успевают сделать за это время: если их сумма не меньше n-1, 
# то оставшиеся копии можно получить за найденное время после первой копии на более быстром ксероксе.

def copyTime(n, x, y):
    l, r = 0, (n - 1) * max(x, y)
    while l + 1 < r:
        mid = (l + r) // 2
        if mid // x + mid // y < n - 1:
            l = mid
        else:
            r = mid
    return r + min(x, y)

def main():
    print(copyTime(4, 1, 2))

if __name__ == "__main__":
    main()
